---
kind: property
id: P:Autodesk.Revit.DB.SymbolicCurveArray.Size
source: html/bbae8610-5c88-50ea-1362-36f4321ab3a0.htm
---
# Autodesk.Revit.DB.SymbolicCurveArray.Size Property

Returns the number of model curves that are in the array.

## Syntax (C#)
```csharp
public virtual int Size { get; }
```